# GetLocPt

## Description
Procedure GetLocPt returns the coordinate location of the referenced locus.

```pascal
PROCEDURE GetLocPt(
				h     : HANDLE;
				VAR p : REAL);
```

```python

def vs.GetLocPt(h):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to locus.|
|p|REAL|Coordinates of locus point.|

## Version
Availability: from MiniCAD
## Category
* Objects - 2D